import Title from "antd/lib/typography/Title";
import { useEffect } from "react";

export default function () {
  return (
    <>
      <div>
        <Title>用户注册协议</Title>
        <Title level={5}>• 提示条款</Title>
        欢迎您（以下亦称“会员”）向广元广财企业服务有限公司（以下简称“我司”）申请
        注册成为我司运营、管理的网站或其他我司相关软件服务端，包括但不限于APP、网页、公众号、微信端小程序等（以下简称“平台”）的会员，并使用我司提供的服务（以下简称“平台服务”）。本协议项下以及您使用平台服务过程中，与平台相关的一切权利和义务均由我司享有和承担。
        为了维护您的合法权益，请在勾选/签署本协议前，仔细阅读、充分理解本协议各条款内容，特别是免除或减轻我司责任，或排除、限制您权利的条款，相关条款可能以加黑加粗形式提示您。如您对本协议有任何疑问，可通过平台或我司客服咨询。
        当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，且受本协议全部条款约束；当您注册成功，无论是否进入平台，还是在平台发布任何内容，或者是直接或通过各类方式（如站外API引用等）间接使用平台的产品服务的行为，都将被视作为对本协议的认可。您如有违反本协议而导致的任何法律后果，由您自己独立承担相应的法律责任。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
        在本协议履行过程中，我司有权根据实际情况对本协议的相关条款进行修订。一旦本协议内容发生变更，我司将通过平台公布最新的《用户注册协议》，并通过站内信、邮件、短信、电话、推送等任一方式及时告知，您本人应及时了解修订内容。如果您不同意我司对本协议所做的修订，应立即停止使用平台服务。如果您继续使用平台服务，则视为接受我司对本协议所做的修订，并应遵照修订后的协议履行应尽义务。
        <Title level={5}>第一条 用户注册与登录</Title>
        1.1
        您注册成为平台会员后，即可通过注册时预留的手机号码及密码或验证码登录我司平台。我司有权对平台提供的服务或产品形态进行升级或其他调整，具体以最新页面展示为准。
        <br />
        1.2您有义务确保个人/企业信息资料（包括但不限于您的姓名/名称及电子邮件地址、联系电话、联系地址、法定代表人、统一社会信用代码、企业地址等）的真实性、准确性、完整性和有效性，并承诺对个人/企业信息资料及时更新，您的联系方式发生变更时，应及时在平台进行更新。因您未提供有效联系方式（包括但不限于提供信息有误或未及时更新等），导致平台未能提供服务时，造成的损失及法律后果，由您自行承担。我司有权基于独立判断认定会员资料存在错误、虚假、过时或不完整的嫌疑，或基于法律法规、监管部门及运行和交易安全的需要，我司可以限制、改变、减少、终止或暂时停止提供平台服务的部分或全部功能，或提供、增加新的功能。在任何功能减少、增加或者变化时，只要您仍然使用平台的服务，表示您即同意因该等功能减少、增加或者变化而带来/导致的本协议的变更和调整并受其约束。
        <br />
        1.3会员资格：您确认，在您开始使用/注册程序使用平台服务前，您必须为符合中华人民共和国法律规定的具有完全民事权利能力和完全民事行为能力，能够独立承担民事责任的自然人、法人或者其他组织。若您违反前述规定注册使用平台服务的，您的监护人/负责人应承担因此导致的一切后果和责任。
        <br />
        1.4会员服务：我公司旨在运用大数据、云计算、人工智能等技术，搭建面向广元中小微企业/个人的融资智能匹配、产业政策精准推送等在线服务平台。帮助金融机构完善用户画像，提高金融科技能力及普惠服务水平。提升普惠信贷可得性，降低融资成本，助力民营经济长期健康发展。您注册并登录平台后，将可以享受相关服务，我们将在页面展示第三方的产品信息，您可以在平台申请服务，也可以通过平台直接向第三方申请服务，无论您采用哪种方式，您申请服务所需的必要信息将共享给第三方。
        <br />
        1.5在实际享受平台相关服务、申请贷款前，需要您按照平台要求及相关法律规定完成实名认证。如您的账户连续一年以上未登录或实际使用的，我司有权(无义务)予以进行注销等清理操作，您的账户将不能再登录平台，相应服务同时终止，我司对此造成的任何损失不承担赔偿责任。我司在对此类账户进行清理前，将以包括但不限于站内信、平台公告、客户端推送、电话、短信、电子邮件、微信公众号通知等方式之一通知您。
        <br />
        1.6合法使用：您同意并保证绝不为任何非法目的或以任何非法方式利用平台的服务从事侵害他人权益或违法行为，并承诺遵守中国相关法律、法规、规章制度及所有相关规则，遵守所有与平台服务有关的协议、规则和程序。因违背前述承诺造成的损失及后果，我们有权采取关停账户、删除相关信息等措施，由您自行承担全部责任。
        <br />
        1.7
        安全登录：您应自行负责在每次使用平台服务时应通过安全的计算机、通讯设备及网络环境登录平台。我司对您使用了不安全的计算机、通讯设备或网络环境而导致的任何损失均不承担责任，无论您是否知晓该等不安全状态或是否有意使用。如您使用了不安全的计算机、通讯设备或网络环境而导致我司或任何其他方受到任何损失，我司有权要求您赔偿该等损失、或协助受到损失的一方要求您赔偿该等损失、或为该等索赔主张提供有关您的个人信息或交易信息等。
        <br />
        1.8
        手机号码、手机验证码与密码将视为证明您用户身份的重要凭据，您需妥善保管手机号码、验证码与密码，所有通过密码确认的指令或验证时发送至您在业务平台预留手机号码的手机验证码而确认的指令，无论是否由您本人直接操作，均视为您本人做出。
        <br />
        1.9
        如果您连续多次输入错误的登录信息，并达到业务平台认为合理的次数限制，业务平台将视情况在一定期间拒绝接受您的任何指令。在该等情况下，您可以在锁定期后重新发送指令，也可以在锁定期内拨打我们客服电话：0839-3617508，或者按业务平台的提示验证您的身份，并申请解除锁定。
        <br />
        1.10变更密码及预留手机号码，您需要拨打我们的客服电话：0839-3617508，或以业务平台允许的其他方式予以操作。
        <br />
        1.11您使用注册、登录相关服务过程中，我们会访问或收集一项或多项您的计算机、手机及其他访问设备发送给我们的硬件、软件在内的信息，您可以授权我们获取您的常用设备与网络信息和安装应用列表，便于我们通过识别您的个人常用设备情况，辨别设备是否为模拟器，进行反欺诈风险评估,提升您的账户安全。同时，我们有权对您在任何时候登录业务平台的设备进行可信度判断，我们对于设备可信度的判断建立在合理且技术可实现的基础上。我们有权基于独立判断限制您登录业务平台并使用服务和（或）产品，或者要求您通过其他方式验证该设备的可信度后才允许您登录业务平台并使用服务。您可以拒绝上述授权，也可以取消相关授权，取消授权后，我们将停止对您上述信息的收集，但无法撤销已经授权收集的信息。
        <Title level={5}>第二条 信息的搜集、使用、分享与保护</Title>
        2.1
        我们重视对您信息的保护。除本协议有约定外，我司将依照《数据安全与隐私保护政策》提供保护，详情请参阅《数据安全与隐私保护政策》。如果您是企业用户，我们还将依法保护您的商业秘密，非经您同意不会对外提供。
        <br />
        2.2
        为更好地向您提供服务，您授权我司收集您在注册过程中主动提供的信息，如：您的电话号码、登录IP、操作系统、登录设备ID、品牌、型号、序列号、精准定位信息度、日志等信息。信息收集后，您授权我司按下列用途合理、必要存储、使用、提供等处理：
        <br />
        2.2.1
        用于改进用户体验，创建数据分析模型，为您提供适合于您的服务，并维护、改进这些服务；
        <br />
        2.2.2
        为使您知晓的我们服务，我们将通过站内信、电子邮件、业务平台、手机短信和（或）电话等任一方式向您发送服务状态的通知、营销活动、市场调查及其他商业性电子信息，您有权拒绝，决绝后我们将停止向您推送广告；
        <br />
        2.2．3 预防或阻止非法的活动；
        <br />
        2.2.4
        为保护您的账户安全，比较信息的准确性并与第三方进行验证，比如验证您的身份信息、企业（含个体工商户）信息等；
        <br />
        2.2.5
        为您提供包括但不限于账户、信贷中介等服务，比如您在开立银行结算账户时身份审核，为您发放贷款时进行贷款调查等；
        <br />
        2．2.6 合理评估您和（或）您关联方的财务状况，防控风险；
        <br />
        2.2.7 经您许可的其他用途。
        <br />
        2.3
        我们根据法律法规及监管规定对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息。您同意并授权我们在下列任一情况下将您的信息与第三方共享：
        <br />
        2.3.1
        获得您的同意或授权的其他情形，具体以您签署的《信息查询与使用授权书》或其他授权文件为准；
        <br />
        2.3.2
        某些服务由我们的合作机构共同提供，在遵循正当、合法、必要的原则下，您同意我们将必要信息提供给合作机构；
        <br />
        2．3.3
        您保证并承诺在我们业务平台中进行的操作行为合法。您同意，我们有权按照包括但不限于公安机关、检察机关、法院等司法机关、行政机关的要求协助对您的用户信息进行核实等操作，并应要求向上述机关提供您的个人信息；
        <br />
        2.3.4
        为您提供包括但不限于账户实名、信贷等服务，比如为您发放贷款时进行贷款调查等；
        <br />
        2.3.5 合理评估您和（或）您关联方的财务状况，防控风险；
        <br />
        2.3.6 根据法律法规的规定及有权机关的要求提供。
        <br />
        2.4
        除您在用户注册过程中主动提供的信息外，在您申请贷款前需完成实名认证，在实名认证时，您同意并授权我们收集、使用其他为您提供服务所必要的信息，具体以《数据安全与隐私保护政策》及《信息查询及授权使用书》要求为准：
        <br />
        2.5
        对于您在平台会员注册过程中向我司提供的信息，若须查询或变更，您可以联系0839-3617508进行操作；对于我司通过您的授权，从平台之外收集到的您的各类信息，若您需要查询或变更，须联系首次收集您该信息的平台。
        <br />
        2.6
        我们将采用行业标准惯例以保护您的用户信息，包括建立相应的信息保护制度、机制和设备，采用加密传输及安全存储方式等，但上述保护措施可能受限于现有技术水平而不能确保您的信息不会通过本协议中未列明的途径泄露出去，我们将在最大程度上维护您的相关权益。
        <br />
        2.7
        若您拒绝提供上述信息，则将无法使用平台的相应服务，但不影响您使用平台的其他功能。
        <Title level={5}>第三条 信息系统终端或故障</Title>
        您理解并同意，基于互联网的特殊性，我司不保证平台服务不会中断，也不保证平台服务的及时性和/或安全性。我司相关系统或软件因下列状况无法正常运行，使您无法使用或无法正常使用任何平台服务或使我司无法根据您的指令行事或者履行本协议项下的其他义务时，我司不承担损害赔偿责任，该状况包括但不限于：
        <br />
        1、在我司相关系统或软件或与账户、交易相关的其他系统或软件之维护期间；
        <br />
        2、电信设备出现故障不能正常进行数据传输的；
        <br />
        3、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成我司相关系统或软件障碍不能正常执行业务的；
        <br />
        4、由于病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、电力故障、网络供应商技术调整或故障、数据来源方或数据合作方原因、银行或支付机构原因、政府行为等原因而造成的服务中断或者延迟；
        <br />
        5、银行、数据合作方、支付机构或其他平台服务提供方系统发生故障或处于维护期间导致产品功能无法实现或出现故障无法顺利完成或出现故障。
        <Title level={5}>第四条 用户其他义务</Title>
        1、您确认并同意，我司有权在提供平台服务过程中以各种方式向您投放各种商业性广告或其他任何类型的商业信息（包括但不限于在平台的任何页面上投放广告），并且，您同意接受平台通过电子邮件、短信、站内信或其他方式向您发送金融服务资讯或其他相关商业信息，你有权拒绝，拒绝后不影响您继续使用。
        <br />
        2、用户承诺，不对本网站上的任何数据做商业性利用，包括但不限于在未经我们事先同意的情况下，以复制、传播等任何方式使用本网站上展示的资料。
        <br />
        3、在接受服务时必须遵守中国法律法规、规章以及政府规范性文件，不得作出违法违规的行为，具体如下：
        <br />
        （1）发表、传达、传播、储存侵害他人知识产权、人身权、商业秘密等合法权益的内容；
        <br />
        （2）编造、伪造虚假身份、提供虚假信息、冒充他人身份、发布虚假信息等误导、欺骗他人，或违背我们的页面公布之活动规则进行虚假交易、欺诈套现；
        <br />
        （3）进行危害计算机网络安全的行为。包括但不限于在用户发布的信息中含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序；
        <br />
        （4）不发布国家禁止发布的信息，不发布其他涉嫌违法或违反本协议及各类规则的信息。
        <Title level={5}>第五条 免责条款</Title>
        5.1您同意并保证，不向其他任何人泄露您在注册和登陆时向我司提交的登录密码、验证码等信息，上述信息是您在我司平台的唯一身份识别信息。您知晓并理解，您应妥善保管您的手机号、密码及与账户有关的一切信息。如非因我司原因造成您账户密码或相关信息泄露的，您应及时通知我司，以减少可能发生的损失，因上述原因导致的损失需由您自行承担。
        <br />
        5.2如您发现有他人冒用或盗用您的手机、账户及密码或进行其他任何未经合法授权行为之情形时，应立即以书面或口头方式通知我司并要求我司暂停服务。我司将积极响应您的要求；但您需理解，对您的要求所采取的行动需要合理期限，在此之前，我司对已执行的指令及(或)所导致的您的损失不承担任何责任。
        <br />
        5.3您知悉平台服务内容可能涉及由第三方所有、控制或者运营的其他网站（以下简称“第三方”），或含有访问第三方网站的链接；我司可能会在任何需要的时候增加商业伙伴第三方网站。我司不能保证也没有义务保证、审核第三方提供信息的真实性、准确性和有效性，也无法对所有第三方网站的隐私保护措施负责。您确认按照第三方的相关服务协议而非本协议使用第三方网站。第三方网站非由我司支持或授权，我司不对第三方网站的内容、项目、产品、广告和其他任何信息作任何保证，您应自行判断并承担风险，与我司无关。您经由平台使用下载或取得的任何资料，应由您自行考量且自担风险，因资料的下载（如涉及）而导致的任何损失由您自行承担。
        <br />
        5.4对于您在任何情况下，使用平台服务过程中涉及由第三方提供相关服务非由我司控制，若由第三方服务引发损失和责任由该第三方承担，我司不承担责任。我司不承担责任的情形包括但不限于：
        <br />
        （1）因银行、支付机构等平台服务提供方未按照您和/或我司指令进行操作或其他非我司
        的原因导致资金未能及时到账或未能到账引起的任何损失或责任；
        <br />
        （2）因银行、支付机构等服务提供方对交易限额或次数等方面的限制而引起的任何损失或责任；
        <br />
        （3）第三方服务机构因内部审核、内部安排、规则调整、产品更新等原因，终止向您/我司继续提供服务的；
        <br />
        （4）因其他服务提供方的行为或非我司的任何原因导致的任何损失或责任。
        <br />
        5.5对于因您自身的原因导致的任何损失或责任，我司不承担责任。我司不承担责任的情形包括但不限于：
        <br />
        （1）
        您未按照本协议或平台不时公布的任何规则进行操作导致的任何损失或责任；
        <br />
        （2）
        因您使用的银行卡的原因导致的损失或责任，包括您使用未经认证的银行卡或使用非您本人的银行卡或使用信用卡，您的银行卡被冻结、挂失等导致的任何损失或责任；
        <br />
        （3）
        您向我司发送的指令信息不明确、存在歧义、不完整或其经认证的银行卡账户余额不足导致的任何损失或责任；
        <br />
        （4）
        因您编造、伪造、使用虚假资料、冒充他人身份申请服务，或进行欺诈套现的，我司有权终止向您提供服务，因此给我司、第三方造成损失的，由您承担；
        <br />
        （5） 其他因您原因导致的任何损失或责任。
        <br />
        5.6我司不对您及/或任何交易提供任何担保。我司对平台中非我司发布的内容不承担任何形式的实质性审查、证明和鉴定义务。我司不能完全保证该内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。您应依赖于您的独立判断进行交易，您应对其作出的判断承担全部责任。
        <br />
        5.7
        平台提供的各类贷款、授信等服务由第三方提供，在提供服务前，我司及第三方有权根据从合法渠道获取的信息对您的资信能力进行判断，在对您进行综合评估后，第三方将根据其业务规则自行决定是否批准、发放贷款及授信，也有权自行决定批准的额度。我们展示的产品信息，包括且不限于：贷款、授信额度、担保方式、放款期限等均为暂定信息，最终由第三方审核结果及您与第三方签订的书面合同为准。我司不对您申请的服务是否最终获得第三方批准作出任何保证，也不承担因此产生的任何责任。
        <br />
        5.8
        我司不承担因暂停、中断或终止提供平台服务的全部或部分内容而产生的任何责任，且您同意负担因此所产生的直接或间接的任何支出或损失。您同意，平台服务的暂停、中断或终止不代表会员责任的终止，您仍应对使用平台服务期间的行为承担可能的违约或损害赔偿责任，同时我司仍可保有您的相关信息并根据本协议规定予以使用、披露。
        <br />
        5.9您使用本平台服务，我们为您免费提供服务，我方不会向您收取任何费用。但本公司在法律许可的前提下，有权自行决定是否对提供的服务收取费用及收费方式等，该等关于费用收取的变更将至少提前于该等变更生效之日[
        7
        ]日并在本平台以发布公告等方式通知您，您对该等通知方式予以认可并接受。您使用本公司所提供服务过程中的其他支出，包括但不限于网络使用费、通信费等，由您自行承担。
        <Title level={5}>第六条 知识产权保护</Title>
        6.1平台上所有内容，包括但不限于文字、图片、图形、音频、视频、图表、页面设计、版面框架、有关数据或电子文档等，均受中华人民共和国相关法律法规和相应的国际条约保护，且由我司或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
        <br />
        6.2非经我司或其他权利人书面同意，任何人不得擅自使用、修改、复制、复印、仿造、出售、转售、公开传播、改变、散布、发行或公开发表平台相关知识产权或信息内容。
        <br />
        6.3您不得对平台或其内容进行修改、转售、商业利用或其他衍生利用；不得为其他商业利益而下载或拷贝账户信息或使用任何数据收集和摘录工具。未经我司书面许可，严禁对平台的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录等。未经我司书面许可，您不得以任何方式使用我司或其关联公司的名字、商标、标识或其他专有信息（包括但不限于图像、文字、网页设计或形式）。
        <br />
        6.4您应遵守关于知识产权保护的义务，如有违反，您应对我司及/或其他权利人承担损害赔偿等法律责任。
        <Title level={5}>第七条 协议终止</Title>
        7.1除非我司终止本协议或者您申请终止本协议，否则本协议始终有效。在您违反了本协议规则或我司遇到本协议约定的免责事项时，我司有权在不通知您的情况下在任何时间终止本协议或者限制您使用我司的平台服务，如有异议，您可以通过我司客服电话0839-3617508申请解除并提供证据材料，经我司综合评估决定是否解除限制。
        <br />
        7.2您同意并确认，在本协议终止的情况下，您仍应继续履行您使用平台服务期间所签署之各项法律文件（包括但不限于本协议、对应的交易文件）项下未履行完毕之义务，并对您使用平台服务期间的行为承担可能的违约或损害赔偿责任；此外，在本协议终止的情况下，我司仍可保存您的个人信息和资料并根据本协议规定予以使用和披露。
        <Title level={5}>第八条 通知</Title>
        对于本协议项下的各项通知，我司有权以在平台公示、站内信、电子邮件、短信等任一方式发送，也可以向您的平台账户、您提供的您的电子邮箱和手机号码发送信息的方式发送，还可以拨打您预留的电话号码的方式发送，以及向您预留的地址以快递、挂号信的方式发送，我们可以选择上述方式之一。如以公示方式作出的，在公示当日即视为已经送达；向您的平台账户、您的电子邮箱或手机号码以电子信息形式发送的，一经成功发送即视为已经送达；以电话形式发送的，通知作出之时即为送达；以快递、挂号信的方式发送的，投递之日起第三日视为送达。请您密切关注您的电子邮箱
        、站内消息系统栏中的邮件、平台公告、站内信、信息及手机中的信息，并在您的联系方式发生变更时及时通过操作平台相关板块进行更新，我司仅以您提供的联系方式为准向您发送各项通知，如您因未按上述约定及时进行联系方式更新而导致您发生任何损失的均由您自行承担。您同时同意并确认，若您设置了不接收平台的有关通知或提醒，则您有可能收不到该等通知信息，您不得以您未收到或未阅读该等通知信息而主张相关通知未送达于您。任何因不可归责于我司的原因导致您未在通知发出后收到该等通知的，我司不承担任何责任。
        <Title level={5}>第九条 适用法律及争议解决方式</Title>
        9.1本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。
        <br />
        9.2因本协议引起的任何争议，可以协商解决，协商不成的，您完全同意将争议提交广元仲裁委员会仲裁。在仲裁期间，本协议不涉及争议部分的条款仍须履行。
        <br />
        9.3因仲裁发生的仲裁费、保全费、执行费、律师费、交通费等一切必要费用均由败诉方承担。
        <Title level={5}>第十条 其他</Title>
        10.1若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效。对本协议的内容有任何异议，双方可通过订立补充协议的方式来解决。
        <br />
        10.2您认同以电子数据形式提交、确认或签署任何法律性文件的方式及其法律效力，且认可我司电子数据的有效性和证据效力。我司相关系统所生成和保留记载的相关电子数据及交易记录，以及我司制作或保留的相关电子及纸质单据、凭证、记录等相关资料，均构成有效证明协议双方之间权利义务关系的确定证据。
        <br />
        10.3我司有权将本协议及本协议项下电子补充协议或附件（如有）经过第三方存证机构进行电子固化并保存，将作为争议解决中的证据使用。
        <br />
        10.4本协议适用于您在平台的一切活动。本协议内容包括但不限于协议正文条款，平台已发布的或将来可能发布的各类规则，上述所有条款和规则都应视为本协议不可分割的一部分，与协议正文条款享有同等法律效力。
        <br />
        10.5您确认并同意，我司、我司合作机构及平台服务提供方无需您同意即可向第三方转让您在平台签署的相关合同项下的全部或部分权利和义务。未经我司、我司合作机构及平台服务提供方事先书面同意，您不得转让其在平台签署的相关合同项下的任何权利和义务。
        <br />
        10.6您确认并同意，我司无需您同意即有权将本协议项下与我司相关的全部或部分权利义务转让给第三方。若您不同意上述变更，应告知我司并停止使用平台服务，继续享受平台服务的，则视为您同意变更。
        <br />
        10.7我司对本协议拥有解释权。
        <Title level={5}>第十一条 重要提示：</Title>
        11.1本协议不因您与平台服务提供方签订的借款合同、担保合同等合同条款无效而无效。若本协议系在线勾选确认的，您同意本协议以数据电文形式订立，您将不会因此否认本协议的法律效力。
        <br />
        11.2您已知悉本协议所有内容（特别是加黑加粗字体条款），并对本协议条款的含义及相应的法律后果已全部通晓并充分理解，本协议一经勾选/签署即视为您同意本协议内容，并同意承担由此带来的一切法律后果。
      </div>
    </>
  );
}
